molata/HIT_motorAssistant/_c/shouchaoqi_wl8/shouchaoqi_wl8/iodefine_RX610.h
struct st_dmac1 {
    void *DMCSA;
    void *DMCDA;
    unsigned long DMCBC;
    union {
        unsigned long LONG;
        struct {
            unsigned long :4;
            unsigned long OPSEL:4;
            unsigned long :5;
            unsigned long SZSEL:3;
            unsigned long :1;
            unsigned long SMOD:3;
            unsigned long :1;
            unsigned long DMOD:3;
            unsigned long :8;
        } BIT;
    } DMMOD;
    unsigned char wk0[496];
    void *DMRSA;
    void *DMRDA;
    unsigned long DMRBC;
    unsigned char wk1[492];
    union {
        unsigned long LONG;
        struct {
            unsigned long :6;
            unsigned long DSEL:2;
            unsigned long :13;
            unsigned long BRLOD:1;
            unsigned long SRLOD:1;
            unsigned long DRLOD:1;
            unsigned long :2;
            unsigned long DCTG:6;
        } BIT;
    } DMCRA;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char DSCLR:1;
        } BIT;
    } DMCRB;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char ECLR:1;
        } BIT;
    } DMCRC;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char DREQ:1;
        } BIT;
    } DMCRD;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char DEN:1;
        } BIT;
    } DMCRE;
};

struct st_dmac2 {
    void *DMCSA;
    void *DMCDA;
    unsigned long DMCBC;
    union {
        unsigned long LONG;
        struct {
            unsigned long :4;
            unsigned long OPSEL:4;
            unsigned long :5;
            unsigned long SZSEL:3;
            unsigned long :1;
            unsigned long SMOD:3;
            unsigned long :1;
            unsigned long DMOD:3;
            unsigned long :8;
        } BIT;
    } DMMOD;
    unsigned char wk0[496];
    void *DMRSA;
    void *DMRDA;
    unsigned long DMRBC;
    unsigned char wk1[484];
    union {
        unsigned long LONG;
        struct {
            unsigned long :6;
            unsigned long DSEL:2;
            unsigned long :13;
            unsigned long BRLOD:1;
            unsigned long SRLOD:1;
            unsigned long DRLOD:1;
            unsigned long :2;
            unsigned long DCTG:6;
        } BIT;
    } DMCRA;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char DSCLR:1;
        } BIT;
    } DMCRB;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char ECLR:1;
        } BIT;
    } DMCRC;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char DREQ:1;
        } BIT;
    } DMCRD;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char DEN:1;
        } BIT;
    } DMCRE;
};

struct st_dmac3 {
    void *DMCSA;
    void *DMCDA;
    unsigned long DMCBC;
    union {
        unsigned long LONG;
        struct {
            unsigned long :4;
            unsigned long OPSEL:4;
            unsigned long :5;
            unsigned long SZSEL:3;
            unsigned long :1;
            unsigned long SMOD:3;
            unsigned long :1;
            unsigned long DMOD:3;
            unsigned long :8;
        } BIT;
    } DMMOD;
    unsigned char wk0[496];
    void *DMRSA;
    void *DMRDA;
    unsigned long DMRBC;
    unsigned char wk1[476];
    union {
        unsigned long LONG;
        struct {
            unsigned long :6;
            unsigned long DSEL:2;
            unsigned long :13;
            unsigned long BRLOD:1;
            unsigned long SRLOD:1;
            unsigned long DRLOD:1;
            unsigned long :2;
            unsigned long DCTG:6;
        } BIT;
    } DMCRA;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char DSCLR:1;
        } BIT;
    } DMCRB;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char ECLR:1;
        } BIT;
    } DMCRC;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char DREQ:1;
        } BIT;
    } DMCRD;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char DEN:1;
        } BIT;
    } DMCRE;
};

struct st_dmac {
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char DMST:1;
        } BIT;
    } DMSCNT;
    unsigned char wk0[8];
    union {
        unsigned char BYTE;
        struct {
            unsigned char DINTM0:1;
            unsigned char DINTM1:1;
            unsigned char DINTM2:1;
            unsigned char DINTM3:1;
            unsigned char :4;
        } BIT;
    } DMICNT;
    unsigned char wk1[11];
    union {
        unsigned char BYTE;
        struct {
            unsigned char DEDET0:1;
            unsigned char DEDET1:1;
            unsigned char DEDET2:1;
            unsigned char DEDET3:1;
            unsigned char :4;
        } BIT;
    } DMEDET;
    unsigned char wk2[3];
    union {
        unsigned char BYTE;
        struct {
            unsigned char DASTS0:1;
            unsigned char DASTS1:1;
            unsigned char DASTS2:1;
            unsigned char DASTS3:1;
            unsigned char :4;
        } BIT;
    } DMASTS;
};

struct st_icu {
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char IR:1;
        } BIT;
    } IR[254];
    unsigned char wk21[2];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :6;
            unsigned char ISEL:2;
        } BIT;
    } ISELR[253];
    unsigned char wk50[3];
    union {
        unsigned char BYTE;
        struct {
            unsigned char IEN7:1;
            unsigned char IEN6:1;
            unsigned char IEN5:1;
            unsigned char IEN4:1;
            unsigned char IEN3:1;
            unsigned char IEN2:1;
            unsigned char IEN1:1;
            unsigned char IEN0:1;
        } BIT;
    } IER[32];
    unsigned char wk53[224];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :5;
            unsigned char IPR:3;
        } BIT;
    } IPR[144];
    unsigned char wk63[96];
    union {
        unsigned short WORD;
        struct {
            unsigned short FIEN:1;
            unsigned short :7;
            unsigned short FVCT:8;
        } BIT;
    } FIR;
    unsigned char wk64[20238];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char IRQEN:1;
        } BIT;
    } IRQER[16];
    unsigned char wk65[16];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char IRQMD:2;
            unsigned char :2;
        } BIT;
    } IRQCR[16];
    unsigned char wk66[16];
    union {
        unsigned short WORD;
        struct {
            unsigned short SSI15:1;
            unsigned short SSI14:1;
            unsigned short SSI13:1;
            unsigned short SSI12:1;
            unsigned short SSI11:1;
            unsigned short SSI10:1;
            unsigned short SSI9:1;
            unsigned short SSI8:1;
            unsigned short SSI7:1;
            unsigned short SSI6:1;
            unsigned short SSI5:1;
            unsigned short SSI4:1;
            unsigned short SSI3:1;
            unsigned short SSI2:1;
            unsigned short SSI1:1;
            unsigned short SSI0:1;
        } BIT;
    } SSIER;
    unsigned char wk67[14];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char NMIEN:1;
        } BIT;
    } NMIER;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char NMIMD:1;
            unsigned char :3;
        } BIT;
    } NMICR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char NMIST:1;
        } BIT;
    } NMISR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char NMICLR:1;
        } BIT;
    } NMICLR;
};

struct st_dtc {
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char RRS:1;
            unsigned char RCHNE:1;
            unsigned char :2;
            unsigned char ERR:1;
        } BIT;
    } DTCCR;
    unsigned char wk0[3];
    void *DTCVBR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char SHORT:1;
        } BIT;
    } DTCADMOD;
    unsigned char wk1[3];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char DTCST:1;
        } BIT;
    } DTCST;
};

struct st_cmt {
    union {
        unsigned short WORD;
        struct {
            unsigned short :14;
            unsigned short STR1:1;
            unsigned short STR0:1;
        } BIT;
    } CMSTR0;
    unsigned char wk0[14];
    union {
        unsigned short WORD;
        struct {
            unsigned short :14;
            unsigned short STR3:1;
            unsigned short STR2:1;
        } BIT;
    } CMSTR1;
};

struct st_cmt0 {
    union {
        unsigned short WORD;
        struct {
            unsigned short :9;
            unsigned short CMIE:1;
            unsigned short :4;
            unsigned short CKS:2;
        } BIT;
    } CMCR;
    unsigned short CMCNT;
    unsigned short CMCOR;
};

union un_wdt {
    struct {
        union {
            unsigned char BYTE;
            struct {
                unsigned char :1;
                unsigned char TMS:1;
                unsigned char TME:1;
                unsigned char :2;
                unsigned char CKS:3;
            } BIT;
        } TCSR;
        unsigned char TCNT;
        unsigned char wk0[1];
        union {
            unsigned char BYTE;
            struct {
                unsigned char WOVF:1;
                unsigned char RSTE:1;
                unsigned char :6;
            } BIT;
        } RSTCSR;
    } READ;
    struct {
        unsigned short WINA;
        unsigned short WINB;
    } WRITE;
};

struct st_ad {
    unsigned short ADDRA;
    unsigned short ADDRB;
    unsigned short ADDRC;
    unsigned short ADDRD;
    unsigned char wk0[8];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char ADIE:1;
            unsigned char ADST:1;
            unsigned char :1;
            unsigned char CH:4;
        } BIT;
    } ADCSR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char TRGS:3;
            unsigned char :1;
            unsigned char CKS:2;
            unsigned char MODE:2;
        } BIT;
    } ADCR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char DPSEL:1;
            unsigned char :7;
        } BIT;
    } ADDPR;
    unsigned char ADSSTR;
};

struct st_da {
    unsigned short DADR0;
    unsigned short DADR1;
    union {
        unsigned char BYTE;
        struct {
            unsigned char DAOE1:1;
            unsigned char DAOE0:1;
            unsigned char DAE:1;
            unsigned char :5;
        } BIT;
    } DACR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char DPSEL:1;
            unsigned char :7;
        } BIT;
    } DADPR;
};

