molata/HIT_motorAssistant/_c/shouchaoqi_wl8/shouchaoqi_wl8/iodefine_RX610.h
struct st_porte {
    union {
        unsigned char BYTE;
        struct {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } DDR;
    unsigned char wk0[31];
    union {
        unsigned char BYTE;
        struct {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } DR;
    unsigned char wk1[31];
    union {
        unsigned char BYTE;
        struct {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PORT;
    unsigned char wk2[31];
    union {
        unsigned char BYTE;
        struct {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } ICR;
    unsigned char wk3[95];
    union {
        unsigned char BYTE;
        struct {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PCR;
};

struct st_portf {
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } DDR;
    unsigned char wk0[31];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } DR;
    unsigned char wk1[31];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PORT;
    unsigned char wk2[31];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } ICR;
};

struct st_portg {
    union {
        unsigned char BYTE;
        struct {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } DDR;
    unsigned char wk0[31];
    union {
        unsigned char BYTE;
        struct {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } DR;
    unsigned char wk1[31];
    union {
        unsigned char BYTE;
        struct {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PORT;
    unsigned char wk2[31];
    union {
        unsigned char BYTE;
        struct {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } ICR;
};

struct st_porth {
    union {
        unsigned char BYTE;
        struct {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } DDR;
    unsigned char wk0[31];
    union {
        unsigned char BYTE;
        struct {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } DR;
    unsigned char wk1[31];
    union {
        unsigned char BYTE;
        struct {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PORT;
    unsigned char wk2[31];
    union {
        unsigned char BYTE;
        struct {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } ICR;
};

struct st_ioport {
    union {
        unsigned char BYTE;
        struct {
            unsigned char CS7E:1;
            unsigned char CS6E:1;
            unsigned char CS5E:1;
            unsigned char CS4E:1;
            unsigned char CS3E:1;
            unsigned char CS2E:1;
            unsigned char CS1E:1;
            unsigned char CS0E:1;
        } BIT;
    } PFCR0;
    union {
        unsigned char BYTE;
        struct {
            unsigned char CS7S:2;
            unsigned char CS6S:2;
            unsigned char CS5S:2;
            unsigned char CS4S:2;
        } BIT;
    } PFCR1;
    union {
        unsigned char BYTE;
        struct {
            unsigned char CS3S:1;
            unsigned char CS2S:1;
            unsigned char :6;
        } BIT;
    } PFCR2;
    union {
        unsigned char BYTE;
        struct {
            unsigned char A23E:1;
            unsigned char A22E:1;
            unsigned char A21E:1;
            unsigned char A20E:1;
            unsigned char A19E:1;
            unsigned char A18E:1;
            unsigned char A17E:1;
            unsigned char A16E:1;
        } BIT;
    } PFCR3;
    union {
        unsigned char BYTE;
        struct {
            unsigned char A15E:1;
            unsigned char A14E:1;
            unsigned char A13E:1;
            unsigned char A12E:1;
            unsigned char A11E:1;
            unsigned char A10E:1;
            unsigned char A9E:1;
            unsigned char A8E:1;
        } BIT;
    } PFCR4;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char WR1BC1E:1;
            unsigned char :1;
            unsigned char DHE:1;
            unsigned char TCLKS:1;
            unsigned char :3;
        } BIT;
    } PFCR5;
    union {
        unsigned char BYTE;
        struct {
            unsigned char TPUMS5:1;
            unsigned char TPUMS4:1;
            unsigned char TPUMS3A:1;
            unsigned char TPUMS3B:1;
            unsigned char TPUMS2:1;
            unsigned char TPUMS1:1;
            unsigned char TPUMS0A:1;
            unsigned char TPUMS0B:1;
        } BIT;
    } PFCR6;
    union {
        unsigned char BYTE;
        struct {
            unsigned char TPUMS11:1;
            unsigned char TPUMS10:1;
            unsigned char TPUMS9A:1;
            unsigned char TPUMS9B:1;
            unsigned char TPUMS8:1;
            unsigned char TPUMS7:1;
            unsigned char TPUMS6A:1;
            unsigned char TPUMS6B:1;
        } BIT;
    } PFCR7;
    union {
        unsigned char BYTE;
        struct {
            unsigned char ITS15:1;
            unsigned char ITS14:1;
            unsigned char ITS13:1;
            unsigned char ITS12:1;
            unsigned char ITS11:1;
            unsigned char ITS10:1;
            unsigned char ITS9:1;
            unsigned char ITS8:1;
        } BIT;
    } PFCR8;
    union {
        unsigned char BYTE;
        struct {
            unsigned char ITS7:1;
            unsigned char ITS6:1;
            unsigned char ITS5:1;
            unsigned char ITS4:1;
            unsigned char ITS3:1;
            unsigned char ITS2:1;
            unsigned char ITS1:1;
            unsigned char ITS0:1;
        } BIT;
    } PFCR9;
};

struct st_flash {
    unsigned char dummy;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :6;
            unsigned char FLWE:2;
        } BIT;
    } FWEPROR;
    unsigned char wk0[7799160];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char FRDMD:1;
            unsigned char :4;
        } BIT;
    } FMODR;
    unsigned char wk1[13];
    union {
        unsigned char BYTE;
        struct {
            unsigned char ROMAE:1;
            unsigned char :2;
            unsigned char CMDLK:1;
            unsigned char DFLAE:1;
            unsigned char :1;
            unsigned char DFLRPE:1;
            unsigned char DFLWPE:1;
        } BIT;
    } FASTAT;
    union {
        unsigned char BYTE;
        struct {
            unsigned char ROMAEIE:1;
            unsigned char :2;
            unsigned char CMDLKIE:1;
            unsigned char DFLAEIE:1;
            unsigned char :1;
            unsigned char DFLRPEIE:1;
            unsigned char DFLWPEIE:1;
        } BIT;
    } FAEINT;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char FRDYIE:1;
        } BIT;
    } FRDYIE;
    unsigned char wk2[45];
    union {
        unsigned short WORD;
        struct {
            unsigned short KEY:8;
            unsigned short :4;
            unsigned short DBRE3:1;
            unsigned short DBRE2:1;
            unsigned short DBRE1:1;
            unsigned short DBRE0:1;
        } BIT;
    } DFLRE;
    unsigned char wk3[14];
    union {
        unsigned short WORD;
        struct {
            unsigned short KEY:8;
            unsigned short :4;
            unsigned short DBWE3:1;
            unsigned short DBWE2:1;
            unsigned short DBWE1:1;
            unsigned short DBWE0:1;
        } BIT;
    } DFLWE;
    unsigned char wk4[2];
    union {
        unsigned short WORD;
        struct {
            unsigned short KEY:8;
            unsigned short :7;
            unsigned short FCRME:1;
        } BIT;
    } FCURAME;
    unsigned char wk5[15194];
    union {
        unsigned char BYTE;
        struct {
            unsigned char FRDY:1;
            unsigned char ILGLERR:1;
            unsigned char ERSERR:1;
            unsigned char PRGERR:1;
            unsigned char SUSRDY:1;
            unsigned char :1;
            unsigned char ERSSPD:1;
            unsigned char PRGSPD:1;
        } BIT;
    } FSTATR0;
    union {
        unsigned char BYTE;
        struct {
            unsigned char FCUERR:1;
            unsigned char :2;
            unsigned char FLOCKST:1;
            unsigned char :4;
        } BIT;
    } FSTATR1;
    union {
        unsigned short WORD;
        struct {
            unsigned short FEKEY:8;
            unsigned short FENTRYD:1;
            unsigned short :5;
            unsigned short FENTRY1:1;
            unsigned short FENTRY0:1;
        } BIT;
    } FENTRYR;
    union {
        unsigned short WORD;
        struct {
            unsigned short FPKEY:8;
            unsigned short :7;
            unsigned short FPROTCN:1;
        } BIT;
    } FPROTR;
    union {
        unsigned short WORD;
        struct {
            unsigned short FRKEY:8;
            unsigned short :7;
            unsigned short FRESET:1;
        } BIT;
    } FRESETR;
    unsigned char wk6[2];
    union {
        unsigned short WORD;
        struct {
            unsigned short CMDR:8;
            unsigned short PCMDR:8;
        } BIT;
    } FCMDR;
    unsigned char wk7[12];
    union {
        unsigned short WORD;
        struct {
            unsigned short :15;
            unsigned short ESUSPMD:1;
        } BIT;
    } FCPSR;
    union {
        unsigned short WORD;
        struct {
            unsigned short :3;
            unsigned short BCADR:10;
            unsigned short :2;
            unsigned short BCSIZE:1;
        } BIT;
    } DFLBCCNT;
    union {
        unsigned short WORD;
        struct {
            unsigned short :8;
            unsigned short PEERRST:8;
        } BIT;
    } FPESTAT;
    union {
        unsigned short WORD;
        struct {
            unsigned short :15;
            unsigned short BCST:1;
        } BIT;
    } DFLBCSTAT;
    unsigned char wk8[24];
    union {
        unsigned short WORD;
        struct {
            unsigned short :8;
            unsigned short PCKA:8;
        } BIT;
    } PCKAR;
};


#define SYSTEM (*(volatile struct st_system __evenaccess *)0x80000)
#define BSC (*(volatile struct st_bsc __evenaccess *)0x81300)
#define DMAC0 (*(volatile struct st_dmac0 __evenaccess *)0x82000)
#define DMAC1 (*(volatile struct st_dmac1 __evenaccess *)0x82010)
#define DMAC2 (*(volatile struct st_dmac2 __evenaccess *)0x82020)
#define DMAC3 (*(volatile struct st_dmac3 __evenaccess *)0x82030)
#define DMAC (*(volatile struct st_dmac __evenaccess *)0x82502)
#define ICU (*(volatile struct st_icu __evenaccess *)0x87000)
#define DTC (*(volatile struct st_dtc __evenaccess *)0x87400)
#define CMT (*(volatile struct st_cmt __evenaccess *)0x88000)
#define CMT0 (*(volatile struct st_cmt0 __evenaccess *)0x88002)
#define CMT1 (*(volatile struct st_cmt0 __evenaccess *)0x88008)
#define CMT2 (*(volatile struct st_cmt0 __evenaccess *)0x88012)
#define CMT3 (*(volatile struct st_cmt0 __evenaccess *)0x88018)
#define WDT (*(volatile union un_wdt __evenaccess *)0x88028)
#define AD0 (*(volatile struct st_ad __evenaccess *)0x88040)
#define AD1 (*(volatile struct st_ad __evenaccess *)0x88060)
#define AD2 (*(volatile struct st_ad __evenaccess *)0x88080)
#define AD3 (*(volatile struct st_ad __evenaccess *)0x880A0)
#define DA (*(volatile struct st_da __evenaccess *)0x880C0)
#define TPU (*(volatile struct st_tpu __evenaccess *)0x88100)
#define TPU0 (*(volatile struct st_tpu0 __evenaccess *)0x88110)
#define TPU1 (*(volatile struct st_tpu1 __evenaccess *)0x88120)
#define TPU2 (*(volatile struct st_tpu1 __evenaccess *)0x88130)
#define TPU3 (*(volatile struct st_tpu0 __evenaccess *)0x88140)
#define TPU4 (*(volatile struct st_tpu1 __evenaccess *)0x88150)
#define TPU5 (*(volatile struct st_tpu1 __evenaccess *)0x88160)
#define TPU6 (*(volatile struct st_tpu0 __evenaccess *)0x88180)
#define TPU7 (*(volatile struct st_tpu1 __evenaccess *)0x88190)
#define TPU8 (*(volatile struct st_tpu1 __evenaccess *)0x881A0)
#define TPU9 (*(volatile struct st_tpu0 __evenaccess *)0x881B0)
#define TPU10 (*(volatile struct st_tpu1 __evenaccess *)0x881C0)
#define TPU11 (*(volatile struct st_tpu1 __evenaccess *)0x881D0)
#define PPG0 (*(volatile struct st_ppg0 __evenaccess *)0x881E6)
#define PPG1 (*(volatile struct st_ppg1 __evenaccess *)0x881F0)
#define TMR0 (*(volatile struct st_tmr0 __evenaccess *)0x88200)
#define TMR1 (*(volatile struct st_tmr1 __evenaccess *)0x88201)
#define TMR01 (*(volatile struct st_tmr01 __evenaccess *)0x88204)
#define TMR2 (*(volatile struct st_tmr0 __evenaccess *)0x88210)
#define TMR3 (*(volatile struct st_tmr1 __evenaccess *)0x88211)
#define TMR23 (*(volatile struct st_tmr01 __evenaccess *)0x88214)
#define SCI0 (*(volatile struct st_sci __evenaccess *)0x88240)
#define SCI1 (*(volatile struct st_sci __evenaccess *)0x88248)
#define SCI2 (*(volatile struct st_sci __evenaccess *)0x88250)
#define SCI3 (*(volatile struct st_sci __evenaccess *)0x88258)
#define SCI4 (*(volatile struct st_sci __evenaccess *)0x88260)
#define SCI5 (*(volatile struct st_sci __evenaccess *)0x88268)
#define SCI6 (*(volatile struct st_sci __evenaccess *)0x88270)
#define CRC (*(volatile struct st_crc __evenaccess *)0x88280)
#define RIIC0 (*(volatile struct st_riic __evenaccess *)0x88300)
#define RIIC1 (*(volatile struct st_riic __evenaccess *)0x88320)
#define PORT0 (*(volatile struct st_port0 __evenaccess *)0x8C000)
#define PORT1 (*(volatile struct st_port1 __evenaccess *)0x8C001)
#define PORT2 (*(volatile struct st_port2 __evenaccess *)0x8C002)
#define PORT3 (*(volatile struct st_port3 __evenaccess *)0x8C003)
#define PORT4 (*(volatile struct st_port4 __evenaccess *)0x8C004)
#define PORT5 (*(volatile struct st_port5 __evenaccess *)0x8C005)
#define PORT6 (*(volatile struct st_port6 __evenaccess *)0x8C006)
#define PORT7 (*(volatile struct st_port7 __evenaccess *)0x8C007)
#define PORT8 (*(volatile struct st_port8 __evenaccess *)0x8C008)
#define PORT9 (*(volatile struct st_port9 __evenaccess *)0x8C009)
#define PORTA (*(volatile struct st_porta __evenaccess *)0x8C00A)
#define PORTB (*(volatile struct st_portb __evenaccess *)0x8C00B)
#define PORTC (*(volatile struct st_portc __evenaccess *)0x8C00C)
#define PORTD (*(volatile struct st_portd __evenaccess *)0x8C00D)
#define PORTE (*(volatile struct st_porte __evenaccess *)0x8C00E)
#define PORTF (*(volatile struct st_portf __evenaccess *)0x8C00F)
#define PORTG (*(volatile struct st_portg __evenaccess *)0x8C010)
#define PORTH (*(volatile struct st_porth __evenaccess *)0x8C011)
#define IOPORT (*(volatile struct st_ioport __evenaccess *)0x8C100)
#define FLASH (*(volatile struct st_flash __evenaccess *)0x8C288)

/***********************************************************************/
/*                                                                     */
/*  DESCRIPTION :Definition of ICU Register                            */
/*  CPU TYPE    :RX610                                                 */
/*  HISTORY     :2.00  (2010-03-01)  [Hardware Manual Revision : 1.00] */
/*  NOTE        :This is a typical example.                            */
/*                                                                     */
/*  Usage : IR,ISELR,IER,IPR of ICU Register                           */
/*     The bit access operation is "bit name(interrupt source,name)".  */
/*     A part of the interrupt source can be omitted.                  */
/*     for example :                                                   */
/*       IR(TPU0,TGI0A) = 0;                                           */
/*       ISEL(  ,IRQ0)  = 2;                                           */
/*       IEN(CMT0,CMI0) = 1;                                           */
/*       IPR(TPU0,TGI0A) = 3;                                          */
/*       IPR(TPU0,TGI  ) = 3; // TGI0A,TGI0B,TGI0C,TGI0D is same level.*/
/*       IPR(CMT0,CMI0 ) = 1;                                          */
/*       IPR(CMT0,     ) = 1; // CMT0 interrupt is only one factor.    */
/*                                                                     */
/*  Usage : #pragma interrupt Function_Identifier(vect=**)             */
/*     The number of vector is "(interrupt source, name)".             */
/*     for example :                                                   */
/*       #pragma interrupt INT_TPU0_TGI0A(vect=VECT(TPU0,TGI0A))       */
/*       #pragma interrupt INT_IRQ0      (vect=VECT(    ,IRQ0 ))       */
/*       #pragma interrupt INT_CMT0_CMI0 (vect=VECT(CMT0,CMI0 ))       */
/*                                                                     */
/*  Usage : MSTPCRA,MSTPCRB,MSTPCRC,MSTPCRD of SYSTEM Register         */
/*     The bit access operation is "MSTP(name)". The name that         */
/*     can be used is a macro name defined with "iodefine.h".          */
/*     for example :                                                   */
/*       MSTP(TMR2) = 0; // TMR Unit 1 (TMR3/TMR2)                     */
/*       MSTP(PPG1) = 0; // PPG1                                       */
/*       MSTP(TPU6) = 0; // TPU Unit 1 (TPU6 to TPU11)                 */
/*       MSTP(CMT3) = 0; // CMT Unit 1 (CMT2/CMT3)                     */
/*                                                                     */
/*  Copyright(c) 2010 Renesas Technology Corp.                         */
/*               And Renesas Solutions Corp.,All Rights Reserved.      */
/*                                                                     */
/***********************************************************************/
enum enum_ir {
IR_BUSERR=16,
IR_FCU_FIFERR=21,IR_FCU_FRDYI=23,
IR_CMT0_CMI0=28,IR_CMT1_CMI1,IR_CMT2_CMI2,IR_CMT3_CMI3,
IR__IRQ0=64,IR__IRQ1,IR__IRQ2,IR__IRQ3,IR__IRQ4,IR__IRQ5,IR__IRQ6,IR__IRQ7,IR__IRQ8,IR__IRQ9,IR__IRQ10,IR__IRQ11,IR__IRQ12,IR__IRQ13,IR__IRQ14,IR__IRQ15,
IR_WDT_WOVI=96,
IR_AD0_ADI0=98,IR_AD1_ADI1,IR_AD2_ADI2,IR_AD3_ADI3,
IR_TPU0_TGI0A=104,IR_TPU0_TGI0B,IR_TPU0_TGI0C,IR_TPU0_TGI0D,IR_TPU0_TCI0V,
IR_TPU1_TGI1A=111,IR_TPU1_TGI1B,IR_TPU1_TCI1V=115,IR_TPU1_TCI1U,
IR_TPU2_TGI2A=117,IR_TPU2_TGI2B,IR_TPU2_TCI2V=120,IR_TPU2_TCI2U,
IR_TPU3_TGI3A=122,IR_TPU3_TGI3B,IR_TPU3_TGI3C,IR_TPU3_TGI3D,IR_TPU3_TCI3V,
IR_TPU4_TGI4A=127,IR_TPU4_TGI4B,IR_TPU4_TCI4V=131,IR_TPU4_TCI4U,
IR_TPU5_TGI5A=133,IR_TPU5_TGI5B,IR_TPU5_TCI5V=136,IR_TPU5_TCI5U,
IR_TPU6_TGI6A=138,IR_TPU6_TGI6B,IR_TPU6_TGI6C,IR_TPU6_TGI6D,IR_TPU6_TCI6V,
IR_TPU7_TGI7A=145,IR_TPU7_TGI7B,IR_TPU7_TCI7V=149,IR_TPU7_TCI7U,
IR_TPU8_TGI8A=151,IR_TPU8_TGI8B,IR_TPU8_TCI8V=154,IR_TPU8_TCI8U,
IR_TPU9_TGI9A=156,IR_TPU9_TGI9B,IR_TPU9_TGI9C,IR_TPU9_TGI9D,IR_TPU9_TCI9V,
IR_TPU10_TGI10A=161,IR_TPU10_TGI10B,IR_TPU10_TCI10V=165,IR_TPU10_TCI10U,
IR_TPU11_TGI11A=167,IR_TPU11_TGI11B,IR_TPU11_TCI11V=170,IR_TPU11_TCI11U,
IR_TMR0_CMI0A=174,IR_TMR0_CMI0B,IR_TMR0_OV0I,
IR_TMR1_CMI1A=177,IR_TMR1_CMI1B,IR_TMR1_OV1I,
IR_TMR2_CMI2A=180,IR_TMR2_CMI2B,IR_TMR2_OV2I,
IR_TMR3_CMI3A=183,IR_TMR3_CMI3B,IR_TMR3_OV3I,
IR_DMAC_DMTEND0=198,IR_DMAC_DMTEND1,IR_DMAC_DMTEND2,IR_DMAC_DMTEND3,
IR_SCI0_ERI0=214,IR_SCI0_RXI0,IR_SCI0_TXI0,IR_SCI0_TEI0,
IR_SCI1_ERI1=218,IR_SCI1_RXI1,IR_SCI1_TXI1,IR_SCI1_TEI1,
IR_SCI2_ERI2=222,IR_SCI2_RXI2,IR_SCI2_TXI2,IR_SCI2_TEI2,
IR_SCI3_ERI3=226,IR_SCI3_RXI3,IR_SCI3_TXI3,IR_SCI3_TEI3,
IR_SCI4_ERI4=230,IR_SCI4_RXI4,IR_SCI4_TXI4,IR_SCI4_TEI4,
IR_SCI5_ERI5=234,IR_SCI5_RXI5,IR_SCI5_TXI5,IR_SCI5_TEI5,
IR_SCI6_ERI6=238,IR_SCI6_RXI6,IR_SCI6_TXI6,IR_SCI6_TEI6,
IR_RIIC0_EEI0=246,IR_RIIC0_RXI0,IR_RIIC0_TXI0,IR_RIIC0_TEI0,
IR_RIIC1_EEI1=250,IR_RIIC1_RXI1,IR_RIIC1_TXI1,IR_RIIC1_TEI1
};

