molata/HIT_motorAssistant/_c/shouchaoqi_wl8/shouchaoqi_wl8/iodefine_RX610.h
enum enum_iselr {
ISELR_BUSERR=16,
ISELR_FCU_FIFERR=21,ISELR_FCU_FRDYI=23,
ISELR_CMT0_CMI0=28,ISELR_CMT1_CMI1,ISELR_CMT2_CMI2,ISELR_CMT3_CMI3,
ISELR__IRQ0=64,ISELR__IRQ1,ISELR__IRQ2,ISELR__IRQ3,ISELR__IRQ4,ISELR__IRQ5,ISELR__IRQ6,ISELR__IRQ7,ISELR__IRQ8,ISELR__IRQ9,ISELR__IRQ10,ISELR__IRQ11,ISELR__IRQ12,ISELR__IRQ13,ISELR__IRQ14,ISELR__IRQ15,
ISELR_WDT_WOVI=96,
ISELR_AD0_ADI0=98,ISELR_AD1_ADI1,ISELR_AD2_ADI2,ISELR_AD3_ADI3,
ISELR_TPU0_TGI0A=104,ISELR_TPU0_TGI0B,ISELR_TPU0_TGI0C,ISELR_TPU0_TGI0D,ISELR_TPU0_TCI0V,
ISELR_TPU1_TGI1A=111,ISELR_TPU1_TGI1B,ISELR_TPU1_TCI1V=115,ISELR_TPU1_TCI1U,
ISELR_TPU2_TGI2A=117,ISELR_TPU2_TGI2B,ISELR_TPU2_TCI2V=120,ISELR_TPU2_TCI2U,
ISELR_TPU3_TGI3A=122,ISELR_TPU3_TGI3B,ISELR_TPU3_TGI3C,ISELR_TPU3_TGI3D,ISELR_TPU3_TCI3V,
ISELR_TPU4_TGI4A=127,ISELR_TPU4_TGI4B,ISELR_TPU4_TCI4V=131,ISELR_TPU4_TCI4U,
ISELR_TPU5_TGI5A=133,ISELR_TPU5_TGI5B,ISELR_TPU5_TCI5V=136,ISELR_TPU5_TCI5U,
ISELR_TPU6_TGI6A=138,ISELR_TPU6_TGI6B,ISELR_TPU6_TGI6C,ISELR_TPU6_TGI6D,ISELR_TPU6_TCI6V,
ISELR_TPU7_TGI7A=145,ISELR_TPU7_TGI7B,ISELR_TPU7_TCI7V=149,ISELR_TPU7_TCI7U,
ISELR_TPU8_TGI8A=151,ISELR_TPU8_TGI8B,ISELR_TPU8_TCI8V=154,ISELR_TPU8_TCI8U,
ISELR_TPU9_TGI9A=156,ISELR_TPU9_TGI9B,ISELR_TPU9_TGI9C,ISELR_TPU9_TGI9D,ISELR_TPU9_TCI9V,
ISELR_TPU10_TGI10A=161,ISELR_TPU10_TGI10B,ISELR_TPU10_TCI10V=165,ISELR_TPU10_TCI10U,
ISELR_TPU11_TGI11A=167,ISELR_TPU11_TGI11B,ISELR_TPU11_TCI11V=170,ISELR_TPU11_TCI11U,
ISELR_TMR0_CMI0A=174,ISELR_TMR0_CMI0B,ISELR_TMR0_OV0I,
ISELR_TMR1_CMI1A=177,ISELR_TMR1_CMI1B,ISELR_TMR1_OV1I,
ISELR_TMR2_CMI2A=180,ISELR_TMR2_CMI2B,ISELR_TMR2_OV2I,
ISELR_TMR3_CMI3A=183,ISELR_TMR3_CMI3B,ISELR_TMR3_OV3I,
ISELR_DMAC_DMTEND0=198,ISELR_DMAC_DMTEND1,ISELR_DMAC_DMTEND2,ISELR_DMAC_DMTEND3,
ISELR_SCI0_ERI0=214,ISELR_SCI0_RXI0,ISELR_SCI0_TXI0,ISELR_SCI0_TEI0,
ISELR_SCI1_ERI1=218,ISELR_SCI1_RXI1,ISELR_SCI1_TXI1,ISELR_SCI1_TEI1,
ISELR_SCI2_ERI2=222,ISELR_SCI2_RXI2,ISELR_SCI2_TXI2,ISELR_SCI2_TEI2,
ISELR_SCI3_ERI3=226,ISELR_SCI3_RXI3,ISELR_SCI3_TXI3,ISELR_SCI3_TEI3,
ISELR_SCI4_ERI4=230,ISELR_SCI4_RXI4,ISELR_SCI4_TXI4,ISELR_SCI4_TEI4,
ISELR_SCI5_ERI5=234,ISELR_SCI5_RXI5,ISELR_SCI5_TXI5,ISELR_SCI5_TEI5,
ISELR_SCI6_ERI6=238,ISELR_SCI6_RXI6,ISELR_SCI6_TXI6,ISELR_SCI6_TEI6,
ISELR_RIIC0_EEI0=246,ISELR_RIIC0_RXI0,ISELR_RIIC0_TXI0,ISELR_RIIC0_TEI0,
ISELR_RIIC1_EEI1=250,ISELR_RIIC1_RXI1,ISELR_RIIC1_TXI1,ISELR_RIIC1_TEI1
};

enum enum_ier {
IER_BUSERR=0x02,
IER_FCU_FIFERR=0x02,IER_FCU_FRDYI=0x02,
IER_CMT0_CMI0=0x03,IER_CMT1_CMI1=0x03,IER_CMT2_CMI2=0x03,IER_CMT3_CMI3=0x03,
IER__IRQ0=0x08,IER__IRQ1=0x08,IER__IRQ2=0x08,IER__IRQ3=0x08,IER__IRQ4=0x08,IER__IRQ5=0x08,IER__IRQ6=0x08,IER__IRQ7=0x08,IER__IRQ8=0x09,IER__IRQ9=0x09,IER__IRQ10=0x09,IER__IRQ11=0x09,IER__IRQ12=0x09,IER__IRQ13=0x09,IER__IRQ14=0x09,IER__IRQ15=0x09,
IER_WDT_WOVI=0x0C,
IER_AD0_ADI0=0x0C,IER_AD1_ADI1=0x0C,IER_AD2_ADI2=0x0C,IER_AD3_ADI3=0x0C,
IER_TPU0_TGI0A=0x0D,IER_TPU0_TGI0B=0x0D,IER_TPU0_TGI0C=0x0D,IER_TPU0_TGI0D=0x0D,IER_TPU0_TCI0V=0x0D,
IER_TPU1_TGI1A=0x0D,IER_TPU1_TGI1B=0x0E,IER_TPU1_TCI1V=0x0E,IER_TPU1_TCI1U=0x0E,
IER_TPU2_TGI2A=0x0E,IER_TPU2_TGI2B=0x0E,IER_TPU2_TCI2V=0x0F,IER_TPU2_TCI2U=0x0F,
IER_TPU3_TGI3A=0x0F,IER_TPU3_TGI3B=0x0F,IER_TPU3_TGI3C=0x0F,IER_TPU3_TGI3D=0x0F,IER_TPU3_TCI3V=0x0F,
IER_TPU4_TGI4A=0x0F,IER_TPU4_TGI4B=0x10,IER_TPU4_TCI4V=0x10,IER_TPU4_TCI4U=0x10,
IER_TPU5_TGI5A=0x10,IER_TPU5_TGI5B=0x10,IER_TPU5_TCI5V=0x11,IER_TPU5_TCI5U=0x11,
IER_TPU6_TGI6A=0x11,IER_TPU6_TGI6B=0x11,IER_TPU6_TGI6C=0x11,IER_TPU6_TGI6D=0x11,IER_TPU6_TCI6V=0x11,
IER_TPU7_TGI7A=0x12,IER_TPU7_TGI7B=0x12,IER_TPU7_TCI7V=0x12,IER_TPU7_TCI7U=0x12,
IER_TPU8_TGI8A=0x12,IER_TPU8_TGI8B=0x13,IER_TPU8_TCI8V=0x13,IER_TPU8_TCI8U=0x13,
IER_TPU9_TGI9A=0x13,IER_TPU9_TGI9B=0x13,IER_TPU9_TGI9C=0x13,IER_TPU9_TGI9D=0x13,IER_TPU9_TCI9V=0x14,
IER_TPU10_TGI10A=0x14,IER_TPU10_TGI10B=0x14,IER_TPU10_TCI10V=0x14,IER_TPU10_TCI10U=0x14,
IER_TPU11_TGI11A=0x14,IER_TPU11_TGI11B=0x15,IER_TPU11_TCI11V=0x15,IER_TPU11_TCI11U=0x15,
IER_TMR0_CMI0A=0x15,IER_TMR0_CMI0B=0x15,IER_TMR0_OV0I=0x16,
IER_TMR1_CMI1A=0x16,IER_TMR1_CMI1B=0x16,IER_TMR1_OV1I=0x16,
IER_TMR2_CMI2A=0x16,IER_TMR2_CMI2B=0x16,IER_TMR2_OV2I=0x16,
IER_TMR3_CMI3A=0x16,IER_TMR3_CMI3B=0x17,IER_TMR3_OV3I=0x17,
IER_DMAC_DMTEND0=0x18,IER_DMAC_DMTEND1=0x18,IER_DMAC_DMTEND2=0x19,IER_DMAC_DMTEND3=0x19,
IER_SCI0_ERI0=0x1A,IER_SCI0_RXI0=0x1A,IER_SCI0_TXI0=0x1B,IER_SCI0_TEI0=0x1B,
IER_SCI1_ERI1=0x1B,IER_SCI1_RXI1=0x1B,IER_SCI1_TXI1=0x1B,IER_SCI1_TEI1=0x1B,
IER_SCI2_ERI2=0x1B,IER_SCI2_RXI2=0x1B,IER_SCI2_TXI2=0x1C,IER_SCI2_TEI2=0x1C,
IER_SCI3_ERI3=0x1C,IER_SCI3_RXI3=0x1C,IER_SCI3_TXI3=0x1C,IER_SCI3_TEI3=0x1C,
IER_SCI4_ERI4=0x1C,IER_SCI4_RXI4=0x1C,IER_SCI4_TXI4=0x1D,IER_SCI4_TEI4=0x1D,
IER_SCI5_ERI5=0x1D,IER_SCI5_RXI5=0x1D,IER_SCI5_TXI5=0x1D,IER_SCI5_TEI5=0x1D,
IER_SCI6_ERI6=0x1D,IER_SCI6_RXI6=0x1D,IER_SCI6_TXI6=0x1E,IER_SCI6_TEI6=0x1E,
IER_RIIC0_EEI0=0x1E,IER_RIIC0_RXI0=0x1E,IER_RIIC0_TXI0=0x1F,IER_RIIC0_TEI0=0x1F,
IER_RIIC1_EEI1=0x1F,IER_RIIC1_RXI1=0x1F,IER_RIIC1_TXI1=0x1F,IER_RIIC1_TEI1=0x1F
};

enum enum_ipr {
IPR_BUSERR,
IPR_FCU_FIFERR,IPR_FCU_FRDYI,
IPR_CMT0_CMI0=0x04,IPR_CMT1_CMI1,IPR_CMT2_CMI2,IPR_CMT3_CMI3,
IPR__IRQ0=0x20,IPR__IRQ1,IPR__IRQ2,IPR__IRQ3,IPR__IRQ4,IPR__IRQ5,IPR__IRQ6,IPR__IRQ7,IPR__IRQ8,IPR__IRQ9,IPR__IRQ10,IPR__IRQ11,IPR__IRQ12,IPR__IRQ13,IPR__IRQ14,IPR__IRQ15,
IPR_WDT_WOVI=0x40,
IPR_AD0_ADI0=0x44,IPR_AD1_ADI1,IPR_AD2_ADI2,IPR_AD3_ADI3,
IPR_TPU0_TGI0A=0x4C,IPR_TPU0_TGI0B=0x4C,IPR_TPU0_TGI0C=0x4C,IPR_TPU0_TGI0D=0x4C,IPR_TPU0_TCI0V=0x4D,
IPR_TPU1_TGI1A=0x4E,IPR_TPU1_TGI1B=0x4E,IPR_TPU1_TCI1V=0x4F,IPR_TPU1_TCI1U=0x4F,
IPR_TPU2_TGI2A=0x50,IPR_TPU2_TGI2B=0x50,IPR_TPU2_TCI2V=0x51,IPR_TPU2_TCI2U=0x51,
IPR_TPU3_TGI3A=0x52,IPR_TPU3_TGI3B=0x52,IPR_TPU3_TGI3C=0x52,IPR_TPU3_TGI3D=0x52,IPR_TPU3_TCI3V=0x53,
IPR_TPU4_TGI4A=0x54,IPR_TPU4_TGI4B=0x54,IPR_TPU4_TCI4V=0x55,IPR_TPU4_TCI4U=0x55,
IPR_TPU5_TGI5A=0x56,IPR_TPU5_TGI5B=0x56,IPR_TPU5_TCI5V=0x57,IPR_TPU5_TCI5U=0x57,
IPR_TPU6_TGI6A=0x58,IPR_TPU6_TGI6B=0x58,IPR_TPU6_TGI6C=0x58,IPR_TPU6_TGI6D=0x58,IPR_TPU6_TCI6V=0x59,
IPR_TPU7_TGI7A=0x5A,IPR_TPU7_TGI7B=0x5A,IPR_TPU7_TCI7V=0x5B,IPR_TPU7_TCI7U=0x5B,
IPR_TPU8_TGI8A=0x5C,IPR_TPU8_TGI8B=0x5C,IPR_TPU8_TCI8V=0x5D,IPR_TPU8_TCI8U=0x5D,
IPR_TPU9_TGI9A=0x5E,IPR_TPU9_TGI9B=0x5E,IPR_TPU9_TGI9C=0x5E,IPR_TPU9_TGI9D=0x5E,IPR_TPU9_TCI9V=0x5F,
IPR_TPU10_TGI10A=0x60,IPR_TPU10_TGI10B=0x60,IPR_TPU10_TCI10V=0x61,IPR_TPU10_TCI10U=0x61,
IPR_TPU11_TGI11A=0x62,IPR_TPU11_TGI11B=0x62,IPR_TPU11_TCI11V=0x63,IPR_TPU11_TCI11U=0x63,
IPR_TMR0_CMI0A=0x68,IPR_TMR0_CMI0B=0x68,IPR_TMR0_OV0I=0x68,
IPR_TMR1_CMI1A=0x69,IPR_TMR1_CMI1B=0x69,IPR_TMR1_OV1I=0x69,
IPR_TMR2_CMI2A=0x6A,IPR_TMR2_CMI2B=0x6A,IPR_TMR2_OV2I=0x6A,
IPR_TMR3_CMI3A=0x6B,IPR_TMR3_CMI3B=0x6B,IPR_TMR3_OV3I=0x6B,
IPR_DMAC_DMTEND0=0x70,IPR_DMAC_DMTEND1,IPR_DMAC_DMTEND2,IPR_DMAC_DMTEND3,
IPR_SCI0_ERI0=0x80,IPR_SCI0_RXI0=0x80,IPR_SCI0_TXI0=0x80,IPR_SCI0_TEI0=0x80,
IPR_SCI1_ERI1=0x81,IPR_SCI1_RXI1=0x81,IPR_SCI1_TXI1=0x81,IPR_SCI1_TEI1=0x81,
IPR_SCI2_ERI2=0x82,IPR_SCI2_RXI2=0x82,IPR_SCI2_TXI2=0x82,IPR_SCI2_TEI2=0x82,
IPR_SCI3_ERI3=0x83,IPR_SCI3_RXI3=0x83,IPR_SCI3_TXI3=0x83,IPR_SCI3_TEI3=0x83,
IPR_SCI4_ERI4=0x84,IPR_SCI4_RXI4=0x84,IPR_SCI4_TXI4=0x84,IPR_SCI4_TEI4=0x84,
IPR_SCI5_ERI5=0x85,IPR_SCI5_RXI5=0x85,IPR_SCI5_TXI5=0x85,IPR_SCI5_TEI5=0x85,
IPR_SCI6_ERI6=0x86,IPR_SCI6_RXI6=0x86,IPR_SCI6_TXI6=0x86,IPR_SCI6_TEI6=0x86,
IPR_RIIC0_EEI0=0x88,IPR_RIIC0_RXI0,IPR_RIIC0_TXI0,IPR_RIIC0_TEI0,
IPR_RIIC1_EEI1,IPR_RIIC1_RXI1,IPR_RIIC1_TXI1,IPR_RIIC1_TEI1,
IPR_CMT0_=0x04,IPR_CMT1_,IPR_CMT2_,IPR_CMT3_,
IPR_WDT_=0x40,
IPR_AD0_=0x44,IPR_AD1_,IPR_AD2_,IPR_AD3_,
IPR_TPU0_TGI=0x4C,IPR_TPU0_TCI,IPR_TPU1_TGI,IPR_TPU1_TCI,IPR_TPU2_TGI,IPR_TPU2_TCI,IPR_TPU3_TGI,IPR_TPU3_TCI,IPR_TPU4_TGI,IPR_TPU4_TCI,IPR_TPU5_TGI,IPR_TPU5_TCI,
IPR_TPU6_TGI,IPR_TPU6_TCI,IPR_TPU7_TGI,IPR_TPU7_TCI,IPR_TPU8_TGI,IPR_TPU8_TCI,IPR_TPU9_TGI,IPR_TPU9_TCI,IPR_TPU10_TGI,IPR_TPU10_TCI,IPR_TPU11_TGI,IPR_TPU11_TCI,
IPR_TMR0_=0x68,IPR_TMR1_,IPR_TMR2_,IPR_TMR3_,
IPR_SCI0_,IPR_SCI1_,IPR_SCI2_,IPR_SCI3_,IPR_SCI4_,IPR_SCI5_,IPR_SCI6_
};

#define IEN_BUSERR			IEN0
#define IEN_FCU_FIFERR		IEN5
#define IEN_FCU_FRDYI		IEN7
#define IEN_CMT0_CMI0		IEN4
#define IEN_CMT1_CMI1		IEN5
#define IEN_CMT2_CMI2		IEN6
#define IEN_CMT3_CMI3		IEN7
#define IEN__IRQ0			IEN0
#define IEN__IRQ1			IEN1
#define IEN__IRQ2			IEN2
#define IEN__IRQ3			IEN3
#define IEN__IRQ4			IEN4
#define IEN__IRQ5			IEN5
#define IEN__IRQ6			IEN6
#define IEN__IRQ7			IEN7
#define IEN__IRQ8			IEN0
#define IEN__IRQ9			IEN1
#define IEN__IRQ10			IEN2
#define IEN__IRQ11			IEN3
#define IEN__IRQ12			IEN4
#define IEN__IRQ13			IEN5
#define IEN__IRQ14			IEN6
#define IEN__IRQ15			IEN7
#define IEN_WDT_WOVI		IEN0
#define IEN_AD0_ADI0		IEN2
#define IEN_AD1_ADI1		IEN3
#define IEN_AD2_ADI2		IEN4
#define IEN_AD3_ADI3		IEN5
#define IEN_TPU0_TGI0A		IEN0
#define IEN_TPU0_TGI0B		IEN1
#define IEN_TPU0_TGI0C		IEN2
#define IEN_TPU0_TGI0D		IEN3
#define IEN_TPU0_TCI0V		IEN4
#define IEN_TPU1_TGI1A		IEN7
#define IEN_TPU1_TGI1B		IEN0
#define IEN_TPU1_TCI1V		IEN3
#define IEN_TPU1_TCI1U		IEN4
#define IEN_TPU2_TGI2A		IEN5
#define IEN_TPU2_TGI2B		IEN6
#define IEN_TPU2_TCI2V		IEN0
#define IEN_TPU2_TCI2U		IEN1
#define IEN_TPU3_TGI3A		IEN2
#define IEN_TPU3_TGI3B		IEN3
#define IEN_TPU3_TGI3C		IEN4
#define IEN_TPU3_TGI3D		IEN5
#define IEN_TPU3_TCI3V		IEN6
#define IEN_TPU4_TGI4A		IEN7
#define IEN_TPU4_TGI4B		IEN0
#define IEN_TPU4_TCI4V		IEN3
#define IEN_TPU4_TCI4U		IEN4
#define IEN_TPU5_TGI5A		IEN5
#define IEN_TPU5_TGI5B		IEN6
#define IEN_TPU5_TCI5V		IEN0
#define IEN_TPU5_TCI5U		IEN1
#define IEN_TPU6_TGI6A		IEN2
#define IEN_TPU6_TGI6B		IEN3
#define IEN_TPU6_TGI6C		IEN4
#define IEN_TPU6_TGI6D		IEN5
#define IEN_TPU6_TCI6V		IEN6
#define IEN_TPU7_TGI7A		IEN1
#define IEN_TPU7_TGI7B		IEN2
#define IEN_TPU7_TCI7V		IEN5
#define IEN_TPU7_TCI7U		IEN6
#define IEN_TPU8_TGI8A		IEN7
#define IEN_TPU8_TGI8B		IEN0
#define IEN_TPU8_TCI8V		IEN2
#define IEN_TPU8_TCI8U		IEN3
#define IEN_TPU9_TGI9A		IEN4
#define IEN_TPU9_TGI9B		IEN5
#define IEN_TPU9_TGI9C		IEN6
#define IEN_TPU9_TGI9D		IEN7
#define IEN_TPU9_TCI9V		IEN0
#define IEN_TPU10_TGI10A	IEN1
#define IEN_TPU10_TGI10B	IEN2
#define IEN_TPU10_TCI10V	IEN5
#define IEN_TPU10_TCI10U	IEN6
#define IEN_TPU11_TGI11A	IEN7
#define IEN_TPU11_TGI11B	IEN0
#define IEN_TPU11_TCI11V	IEN2
#define IEN_TPU11_TCI11U	IEN3
#define IEN_TMR0_CMI0A		IEN6
#define IEN_TMR0_CMI0B		IEN7
#define IEN_TMR0_OV0I		IEN0
#define IEN_TMR1_CMI1A		IEN1
#define IEN_TMR1_CMI1B		IEN2
#define IEN_TMR1_OV1I		IEN3
#define IEN_TMR2_CMI2A		IEN4
#define IEN_TMR2_CMI2B		IEN5
#define IEN_TMR2_OV2I		IEN6
#define IEN_TMR3_CMI3A		IEN7
#define IEN_TMR3_CMI3B		IEN0
#define IEN_TMR3_OV3I		IEN1
#define IEN_DMAC_DMTEND0	IEN6
#define IEN_DMAC_DMTEND1	IEN7
#define IEN_DMAC_DMTEND2	IEN0
#define IEN_DMAC_DMTEND3	IEN1
#define IEN_SCI0_ERI0		IEN6
#define IEN_SCI0_RXI0		IEN7
#define IEN_SCI0_TXI0		IEN0
#define IEN_SCI0_TEI0		IEN1
#define IEN_SCI1_ERI1		IEN2
#define IEN_SCI1_RXI1		IEN3
#define IEN_SCI1_TXI1		IEN4
#define IEN_SCI1_TEI1		IEN5
#define IEN_SCI2_ERI2		IEN6
#define IEN_SCI2_RXI2		IEN7
#define IEN_SCI2_TXI2		IEN0
#define IEN_SCI2_TEI2		IEN1
#define IEN_SCI3_ERI3		IEN2
#define IEN_SCI3_RXI3		IEN3
#define IEN_SCI3_TXI3		IEN4
#define IEN_SCI3_TEI3		IEN5
#define IEN_SCI4_ERI4		IEN6
#define IEN_SCI4_RXI4		IEN7
#define IEN_SCI4_TXI4		IEN0
#define IEN_SCI4_TEI4		IEN1
#define IEN_SCI5_ERI5		IEN2
#define IEN_SCI5_RXI5		IEN3
#define IEN_SCI5_TXI5		IEN4
#define IEN_SCI5_TEI5		IEN5
#define IEN_SCI6_ERI6		IEN6
#define IEN_SCI6_RXI6		IEN7
#define IEN_SCI6_TXI6		IEN0
#define IEN_SCI6_TEI6		IEN1
#define IEN_RIIC0_EEI0		IEN6
#define IEN_RIIC0_RXI0		IEN7
#define IEN_RIIC0_TXI0		IEN0
#define IEN_RIIC0_TEI0		IEN1
#define IEN_RIIC1_EEI1		IEN2
#define IEN_RIIC1_RXI1		IEN3
#define IEN_RIIC1_TXI1		IEN4
#define IEN_RIIC1_TEI1		IEN5

#define VECT_BUSERR			16
#define VECT_FCU_FIFERR		21
#define VECT_FCU_FRDYI		23
#define VECT_CMT0_CMI0		28
#define VECT_CMT1_CMI1		29
#define VECT_CMT2_CMI2		30
#define VECT_CMT3_CMI3		31
#define VECT__IRQ0			64
#define VECT__IRQ1			65
#define VECT__IRQ2			66
#define VECT__IRQ3			67
#define VECT__IRQ4			68
#define VECT__IRQ5			69
#define VECT__IRQ6			70
#define VECT__IRQ7			71
#define VECT__IRQ8			72
#define VECT__IRQ9			73
#define VECT__IRQ10			74
#define VECT__IRQ11			75
#define VECT__IRQ12			76
#define VECT__IRQ13			77
#define VECT__IRQ14			78
#define VECT__IRQ15			79
#define VECT_WDT_WOVI		96
#define VECT_AD0_ADI0		98
#define VECT_AD1_ADI1		99
#define VECT_AD2_ADI2		100
#define VECT_AD3_ADI3		101
#define VECT_TPU0_TGI0A		104
#define VECT_TPU0_TGI0B		105
#define VECT_TPU0_TGI0C		106
#define VECT_TPU0_TGI0D		107
#define VECT_TPU0_TCI0V		108
#define VECT_TPU1_TGI1A		111
#define VECT_TPU1_TGI1B		112
#define VECT_TPU1_TCI1V		115
#define VECT_TPU1_TCI1U		116
#define VECT_TPU2_TGI2A		117
#define VECT_TPU2_TGI2B		118
#define VECT_TPU2_TCI2V		120
#define VECT_TPU2_TCI2U		121
#define VECT_TPU3_TGI3A		122
#define VECT_TPU3_TGI3B		123
#define VECT_TPU3_TGI3C		124
#define VECT_TPU3_TGI3D		125
#define VECT_TPU3_TCI3V		126
#define VECT_TPU4_TGI4A		127
#define VECT_TPU4_TGI4B		128
#define VECT_TPU4_TCI4V		131
#define VECT_TPU4_TCI4U		132
#define VECT_TPU5_TGI5A		133
#define VECT_TPU5_TGI5B		134
#define VECT_TPU5_TCI5V		136
#define VECT_TPU5_TCI5U		137
#define VECT_TPU6_TGI6A		138
#define VECT_TPU6_TGI6B		139
#define VECT_TPU6_TGI6C		140
#define VECT_TPU6_TGI6D		141
#define VECT_TPU6_TCI6V		142
#define VECT_TPU7_TGI7A		145
#define VECT_TPU7_TGI7B		146
#define VECT_TPU7_TCI7V		149
#define VECT_TPU7_TCI7U		150
#define VECT_TPU8_TGI8A		151
#define VECT_TPU8_TGI8B		152
#define VECT_TPU8_TCI8V		154
#define VECT_TPU8_TCI8U		155
#define VECT_TPU9_TGI9A		156
#define VECT_TPU9_TGI9B		157
#define VECT_TPU9_TGI9C		158
#define VECT_TPU9_TGI9D		159
#define VECT_TPU9_TCI9V		160
#define VECT_TPU10_TGI10A	161
#define VECT_TPU10_TGI10B	162
#define VECT_TPU10_TCI10V	165
#define VECT_TPU10_TCI10U	166
#define VECT_TPU11_TGI11A	167
#define VECT_TPU11_TGI11B	168
#define VECT_TPU11_TCI11V	170
#define VECT_TPU11_TCI11U	171
#define VECT_TMR0_CMI0A		174
#define VECT_TMR0_CMI0B		175
#define VECT_TMR0_OV0I		176
#define VECT_TMR1_CMI1A		177
#define VECT_TMR1_CMI1B		178
#define VECT_TMR1_OV1I		179
#define VECT_TMR2_CMI2A		180
#define VECT_TMR2_CMI2B		181
#define VECT_TMR2_OV2I		182
#define VECT_TMR3_CMI3A		183
#define VECT_TMR3_CMI3B		184
#define VECT_TMR3_OV3I		185
#define VECT_DMAC_DMTEND0	198
#define VECT_DMAC_DMTEND1	199
#define VECT_DMAC_DMTEND2	200
#define VECT_DMAC_DMTEND3	201
#define VECT_SCI0_ERI0		214
#define VECT_SCI0_RXI0		215
#define VECT_SCI0_TXI0		216
#define VECT_SCI0_TEI0		217
#define VECT_SCI1_ERI1		218
#define VECT_SCI1_RXI1		219
#define VECT_SCI1_TXI1		220
#define VECT_SCI1_TEI1		221
#define VECT_SCI2_ERI2		222
#define VECT_SCI2_RXI2		223
#define VECT_SCI2_TXI2		224
#define VECT_SCI2_TEI2		225
#define VECT_SCI3_ERI3		226
#define VECT_SCI3_RXI3		227
#define VECT_SCI3_TXI3		228
#define VECT_SCI3_TEI3		229
#define VECT_SCI4_ERI4		230
#define VECT_SCI4_RXI4		231
#define VECT_SCI4_TXI4		232
#define VECT_SCI4_TEI4		233
#define VECT_SCI5_ERI5		234
#define VECT_SCI5_RXI5		235
#define VECT_SCI5_TXI5		236
#define VECT_SCI5_TEI5		237
#define VECT_SCI6_ERI6		238
#define VECT_SCI6_RXI6		239
#define VECT_SCI6_TXI6		240
#define VECT_SCI6_TEI6		241
#define VECT_RIIC0_EEI0		246
#define VECT_RIIC0_RXI0		247
#define VECT_RIIC0_TXI0		248
#define VECT_RIIC0_TEI0		249
#define VECT_RIIC1_EEI1		250
#define VECT_RIIC1_RXI1		251
#define VECT_RIIC1_TXI1		252
#define VECT_RIIC1_TEI1		253

#define MSTP_DMAC0	SYSTEM.MSTPCRA.BIT.MSTPA28
#define MSTP_DMAC1	SYSTEM.MSTPCRA.BIT.MSTPA28
#define MSTP_DMAC2	SYSTEM.MSTPCRA.BIT.MSTPA28
#define MSTP_DMAC3	SYSTEM.MSTPCRA.BIT.MSTPA28
#define MSTP_DMAC	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DTC	SYSTEM.MSTPCRA.BIT.MSTPA27
#define MSTP_AD0	SYSTEM.MSTPCRA.BIT.MSTPA23
#define MSTP_AD1	SYSTEM.MSTPCRA.BIT.MSTPA22
#define MSTP_AD2	SYSTEM.MSTPCRA.BIT.MSTPA21
#define MSTP_AD3	SYSTEM.MSTPCRA.BIT.MSTPA20
#define MSTP_DA		SYSTEM.MSTPCRA.BIT.MSTPA19
#define MSTP_CMT0	SYSTEM.MSTPCRA.BIT.MSTPA15
#define MSTP_CMT1	SYSTEM.MSTPCRA.BIT.MSTPA15
#define MSTP_CMT2	SYSTEM.MSTPCRA.BIT.MSTPA14
#define MSTP_CMT3	SYSTEM.MSTPCRA.BIT.MSTPA14
#define MSTP_TPU0	SYSTEM.MSTPCRA.BIT.MSTPA13
#define MSTP_TPU1	SYSTEM.MSTPCRA.BIT.MSTPA13
#define MSTP_TPU2	SYSTEM.MSTPCRA.BIT.MSTPA13
#define MSTP_TPU3	SYSTEM.MSTPCRA.BIT.MSTPA13
#define MSTP_TPU4	SYSTEM.MSTPCRA.BIT.MSTPA13
#define MSTP_TPU5	SYSTEM.MSTPCRA.BIT.MSTPA13
#define MSTP_TPU6	SYSTEM.MSTPCRA.BIT.MSTPA12
#define MSTP_TPU7	SYSTEM.MSTPCRA.BIT.MSTPA12
#define MSTP_TPU8	SYSTEM.MSTPCRA.BIT.MSTPA12
#define MSTP_TPU9	SYSTEM.MSTPCRA.BIT.MSTPA12
#define MSTP_TPU10	SYSTEM.MSTPCRA.BIT.MSTPA12
#define MSTP_TPU11	SYSTEM.MSTPCRA.BIT.MSTPA12
#define MSTP_PPG0	SYSTEM.MSTPCRA.BIT.MSTPA11
#define MSTP_PPG1	SYSTEM.MSTPCRA.BIT.MSTPA10
#define MSTP_TMR0	SYSTEM.MSTPCRA.BIT.MSTPA5
#define MSTP_TMR1	SYSTEM.MSTPCRA.BIT.MSTPA5
#define MSTP_TMR01	SYSTEM.MSTPCRA.BIT.MSTPA5
#define MSTP_TMR2	SYSTEM.MSTPCRA.BIT.MSTPA4
#define MSTP_TMR3	SYSTEM.MSTPCRA.BIT.MSTPA4
#define MSTP_TMR23	SYSTEM.MSTPCRA.BIT.MSTPA4
#define MSTP_SCI0	SYSTEM.MSTPCRB.BIT.MSTPB31
#define MSTP_SCI1	SYSTEM.MSTPCRB.BIT.MSTPB30
#define MSTP_SCI2	SYSTEM.MSTPCRB.BIT.MSTPB29
#define MSTP_SCI3	SYSTEM.MSTPCRB.BIT.MSTPB28
#define MSTP_SCI4	SYSTEM.MSTPCRB.BIT.MSTPB27
#define MSTP_SCI5	SYSTEM.MSTPCRB.BIT.MSTPB26
#define MSTP_SCI6	SYSTEM.MSTPCRB.BIT.MSTPB25
#define MSTP_CRC	SYSTEM.MSTPCRB.BIT.MSTPB23
#define MSTP_RIIC0	SYSTEM.MSTPCRB.BIT.MSTPB21
#define	MSTP_RIIC1	SYSTEM.MSTPCRB.BIT.MSTPB20
#define MSTP_RAM1	SYSTEM.MSTPCRB.BIT.MSTPC1
#define MSTP_RAM0	SYSTEM.MSTPCRB.BIT.MSTPC0

#define IR( x , y )		ICU.IR[ IR_ ## x ## _ ## y ].BIT.IR
#define ISEL( x , y )	ICU.ISELR[ ISELR_ ## x ## _ ## y ].BIT.ISEL
#define IEN( x , y )	ICU.IER[ IER_ ## x ## _ ## y ].BIT.IEN_ ## x ## _ ## y
#define IPR( x , y )	ICU.IPR[ IPR_ ## x ## _ ## y ].BIT.IPR
#define VECT( x , y )	VECT_ ## x ## _ ## y
#define MSTP( x )		MSTP_ ## x

#pragma packoption
#pragma bit_order
#endif
